import { useState, useEffect, useContext } from 'react'
import axios from 'axios'
import { Link } from 'react-router-dom'
const Privacy = () => {
	const [privacyItem, setPrivacyItem] = useState([])

	useEffect(() => {
		axios
			.get('https://best-marketing.top/api/content-pages/policy-privacy')

			.then(response => {
				const { title, content } = response.data.description
				// Декодирование HTML-сущностей, удаление тегов <pre> и <em>, и замена className на class
				const decodedContent = decodeHtmlEntities(content)
					.replace(/<\/?pre>/g, '')
					.replace(/<\/?em>/g, '') // Удаление тегов <em>
					.replace(/className=/g, 'class=')
				setPrivacyItem({ title, content: decodedContent })
			})
			.catch(error => console.log(error))
	}, [])

	// Функция для декодирования HTML-сущностей в строке и замены className на class
	function decodeHtmlEntities(text) {
		return text
			.replace(/&lt;/g, '<')
			.replace(/&gt;/g, '>')
			.replace(/className=/g, 'class=')
			.replace(/<\/?em>/g, '') // Удаление тегов <em> прямо здесь
	}

	return (
		<div className='container '>
			<h1 className='h2'>{privacyItem.title}</h1>
			{/* <div
				dangerouslySetInnerHTML={{ __html: privacyItem.content }}
				className='text-white'
			></div> */}
			<div>
				<h4 className='h3 text-green'>Останнє оновлення 21 грудня 2023 року</h4>
				<div className='block-text'>
					<p>
						Фізична особа-підприємець Терещенко Олег Олексійович (код ІПН:
						3554803275) та команда AYMA TECH (іменовані надалі “Компанія”
						“Розробник”) вживають всіх можливих заходів для захисту Вашої
						конфіденційності. 
					</p>
					<p>
						Ця Політика конфіденційності та захисту персональних даних визначає
						порядок збору, обробки, використання, розкриття та захисту
						персональних даних, отриманих від відвідувачів нашого веб-сайту
						https://ayma.tech/ («Сайт»).
					</p>
					<p>
						AYMA TECH періодично оновлює цю Політику конфіденційності. Для
						отримання актуальної інформації про стан захисту персональних даних,
						Компанія закликає Користувачів регулярно переглядати Політику
						конфіденційності. 
					</p>
					Дані, які збирає AYMA TECH
				</div>
			</div>
			<div>
				<h4 className='h4'>Дані, які збирає AYMA TECH</h4>
				<div className='block-text'>
					<div>
						<p>
							Під час перебування Користувачів на Сайті, Компанія може збирати
							та обробляти їх дані. До них відносяться:
						</p>
						<ul className='list-disc list-inside py-7 px-2 flex flex-col '>
							<li>
								Персональні дані, що надаються Користувачами, як субʼєктами
								персональних даних, особисто при заповненні реєстраційних форм
								та/або в процесі користування Сайтом. До таких даних належать
								зокрема: ім'я та прізвище, контактний номер телефону, адреса
								електронної пошти, місце роботи, дата народження, стать тощо.
								Використання Сайту відповідно до вимог законодавства є згодою
								суб'єкта персональних даних на їх обробку відповідно до
								сформульованої в цій Політиці мети. 
							</li>
							<li>
								Персональні дані, які Компанія збирає та обробляє автоматично:
								інформація про тип браузера, операційної системи а також інших
								апаратних атрибутів Користувачів, їх IP-адреси, геолокація,
								історія переглядів,  інформація про кількість проведеного на
								Сайті часу, запитувані Користувачами сторінки, дані, які
								містяться в базах даних браузера, включаючи SQL бази даних,
								інформація про використання Користувачами додатків та посилань. 
							</li>
							<li>
								В процесі роботи Сайту, Компанія може збирати та обробляти певну
								інформацію за допомогою технології cookies. Будь ласка,
								ознайомтеся з розділом Наше використання файлів cookies та інших
								механізмів відстеження нижче для отримання більш детальної
								інформації.
							</li>
							<li>
								Персональні дані, що Компанія отримує від сторонніх джерел таких
								як бізнес-клієнти, ділові партнери, постачальники послуг,
								маркетингові партнери, провайдери аналітики даних, рекламні
								мережі, брокери даних, агрегатори даних або інші треті сторони.
							</li>
							<li>
								Персональні дані, повʼязані із участю Користувачів в
								маркетингових кампаніях Компанії. 
							</li>
							<li>
								Персональні дані, отримані Компанією під час обслуговування
								Користувачів та вирішення будь-яких технічних ускладнень.
							</li>
						</ul>
						<p>
							Компанія не збирає будь-яку інформацію про расове або етнічне
							походження, політичні, релігійні, світоглядні переконання,
							членство в політичних партіях та професійних спілках, засудження
							до кримінального покарання в скоєнні злочину або засудження до
							кримінального покарання, а також інформації, що стосуються
							здоров'я, статевого життя, біометричних або генетичних даних.
							Компанія не збирає дані від неповнолітніх користувачів та вважає
							за необхідне попередити, що батьки або законні представники мають
							самостійно вчинити такі дії, які будуть достатніми для запобігання
							використання Сайту неповнолітніми особами. Якщо ви дізналися, що
							ваша ваша неповнолітня дитина надала нам дані, будь ласка,
							повідомте нас про це шляхом надіслання відповідного повідомлення
							на адресу електронної пошти Компанії, вказану у цій Політиці. 
						</p>
						<br />
						<p>
							Якщо Розробник дізнається, що випадково отримав дані неповнолітніх
							осіб без згоди батьків або законних представників, він негайно
							вживе всіх необхідних заходів щодо видалення такої інформації.
						</p>
					</div>
				</div>
			</div>
			<div>
				<h4 className='h4'>Використання файлів Cookie</h4>
				<div className='block-text'>
					<div>
						<p>
							Компанія дбає про своїх Користувачів та намагається зробити
							перебування на Сайті максимально комфортним. Файли Сookie та інші
							технології відстеження допомагають  проаналізувати поведінку,
							переваги і інтереси Користувачів з метою удосконалення Сайту.
						</p>
						<p>
							Cookies - це файли з невеликою кількістю даних, які можуть містити
							анонімний унікальний ідентифікатор. Cookies надсилаються на ваш
							браузер з веб-сайту та зберігаються на вашому пристрої. Ви можете
							налаштувати свій браузер таким чином, щоб відмовитися від усіх
							cookies або їх частини. Однак, якщо ви не приймаєте cookies,
							можливо, ви не зможете використовувати деякі частини наших послуг.
							Файли cookie можуть перманентно зберігатись на вашому пристрої до
							моменту їх мануального видалення або зберігатись тимчасово. Крім
							того, файли cookie поділяються на основні, що  встановлюються
							безпосередньо Сайтом і сторонні, що встановлюються іншими
							веб-сайтами. 
						</p>
						<p>
							Компанія може дозволяти Третім сторонам, таким як постачальники
							рекламних та/або аналітичних послуг, збирати інформацію,
							використовуючи файли cookie та та інші технології відстеження,
							безпосередньо на веб-сторінці Сайту. Зібрані дані підлягають
							захисту відповідно до чинної політики конфіденційності цих Третіх
							сторін.
						</p>
						<p>
							Для отримання більш детальної консультації від Компанії щодо
							використання файлів cookie та та інших технологій відстеження,
							будь ласка,  звʼяжіться з Розробником за адресою електронної пошти
							Компанії, вказаною у цій Політиці.
						</p>
					</div>
				</div>
			</div>
			<div>
				<h4 className='h4'>Обробка та використання зібраних даних</h4>
				<div className='block-text'>
					<div>
						<p>
							Компанія обробляє та використовує персональні дані для досягнення
							наступних цілей:
						</p>
						<ul className='list-disc list-inside py-7 px-2 flex flex-col '>
							<li>
								Забезпечення ефективного обслуговування Користувачів з питань
								використання ними Сайту Компанії, в тому числі, але не
								обмежуючись, з питань створення і управління обліковими
								записами, вирішення технічних ускладнень, а також доступу до
								різних функцій Сайту;
							</li>
							<li>
								Надання інформації про продукти та послуги Компанії, в тому
								числі відповіді на запити, скарги та адміністрування опитувань
								та анкет, повʼязаних із маркетинговими дослідженнями;
							</li>
							<li>
								Для маркетингових цілей, включаючи просування послуг Компанії
								або послуг партнерів Компанії, надання спеціальних пропозицій,
								акцій, новин, розсилки інформаційних бюлетенів, здійснення
								оцінки деяких складових зібраної інформації про Користувачів,
								зокрема, для аналізу та прогнозування їх особистих вподобань,
								інтересів, поведінки;
							</li>
							<li>
								Проведення науково-дослідницької та аналітичної активності з
								метою поліпшення сервісу Компанії;
							</li>
							<li>
								Сповіщення Користувачів про зміни тарифів, послуг, продуктів,
								умов Договорів, в тому числі цієї Політики.
							</li>
							<li>
								Перевірки відповідності Користувачів вимогам цієї Політики.
							</li>
							<li>
								Розслідування та вжиття заходів щодо незаконних дій,
								нестандартних випадків, шахрайства, а також для запобігання
								потенційним загрозам безпеки Сайту, Компанії або Користувачів.
							</li>
						</ul>
						<p>
							Строк зберігання персональних даних залежить від мети обробки, їх
							обсягу, характеру, ризиків заподіяння шкоди у разі розголошення.
							Компанія гарантує, що дані Користувачів зберігатимуться настільки
							довго, наскільки це необхідно для досягнення цілей, заради яких
							вони були зібрані. 
						</p>
						<p>
							Компанія не несе відповідальності за порушення Третіми сторонами
							правил збору, обробки, використання, розкриття та захисту
							отриманої від Користувачів інформації.
						</p>
						<p>
							У разі виникнення питань щодо цілей або строків зберігання даних,
							будь ласка, звʼяжіться з Розробником за адресою електронної пошти
							Компанії, вказаною у цій Політиці. 
						</p>
					</div>
				</div>
			</div>
			<div>
				<h4 className='h4'>Права Користувачів</h4>
				<div className='block-text'>
					<div>
						<p>
							Компанія інформує що права Користувачів, як субʼєктів персональних
							даних, врегульовані Законом України “Про захист персональних
							даних”. До таких прав відносяться:
						</p>
						<ul className='list-disc list-inside py-7 px-2 flex flex-col '>
							<li>
								право знати про джерела збирання, місцезнаходження своїх
								персональних даних, мету їх обробки, місцезнаходження або місце
								проживання (перебування) володільця чи розпорядника персональних
								даних або дати відповідне доручення щодо отримання цієї
								інформації уповноваженим ним особам, крім випадків, встановлених
								законом;
							</li>
							<li>
								право отримувати інформацію про умови надання доступу до
								персональних даних, зокрема інформацію про третіх осіб, яким
								передаються його персональні дані;
							</li>
							<li>право на доступ до своїх персональних даних;</li>
							<li>
								Проведення науково-дослідницької та аналітичної активності з
								метою поліпшення сервісу Компанії;
							</li>
							<li>
								право на отримання не пізніш як за тридцять календарних днів з
								дня надходження запиту, крім випадків, передбачених законом,
								відповіді про те, чи обробляються його персональні дані, а також
								право на отримання змісту таких персональних даних;
							</li>
							<li>
								право предʼявляти вмотивовану вимогу володільцю персональних
								даних із запереченням проти обробки своїх персональних даних;
							</li>
							<li>
								право предʼявляти вмотивовану вимогу щодо зміни або знищення
								своїх персональних даних будь-яким володільцем та розпорядником
								персональних даних, якщо ці дані обробляються незаконно чи є
								недостовірними;
							</li>
							<li>
								право на захист своїх персональних даних від незаконної обробки
								та випадкової втрати, знищення, пошкодження у зв'язку з умисним
								приховуванням, ненаданням чи несвоєчасним їх наданням, а також
								на захист від надання відомостей, що є недостовірними чи
								ганьблять честь, гідність та ділову репутацію фізичної особи;
							</li>
							<li>
								право звертатися із скаргами на обробку своїх персональних даних
								до Уповноваженого Верховної Ради України з прав людини або до
								суду;
							</li>
							<li>
								право на застосування засобів правового захисту в разі порушення
								законодавства про захист персональних даних;
							</li>
							<li>
								право на внесення застереження стосовно обмеження права на
								обробку своїх персональних даних під час надання згоди;
							</li>
							<li>право відкликати згоду на обробку персональних даних;</li>
							<li>
								право на розуміння механізму автоматичної обробки персональних
								даних;
							</li>
							<li>
								право на захист від автоматизованого рішення, яке має для нього
								правові наслідки.
							</li>
						</ul>
						<p>
							Кожен користувач може отримати доступ, оновити, змінити, блокувати
							або видалити свої персональні дані, відкликати згоду на їх обробку
							шляхом надіслання електронного листа на адресу електронної пошти
							Компанії, вказану в цій Політиці. 
						</p>
					</div>
				</div>
			</div>
			<div>
				<h4 className='h4'>Безпека персональних даних</h4>
				<div className='block-text'>
					<div>
						<p>
							Компанія вживає всіх необхідних законних адміністративних,
							логічних, фізичних й управлінських заходів для захисту
							персональних даних Користувачів від крадіжки, незаконного
							використання, зміни, знищення, копіювання, розповсюдження, а також
							від втрати та несанкціонованого доступу до даних третіх осіб. Ці
							заходи спрямовані на те, щоб забезпечити рівень безпеки,
							відповідний ризикам обробки ваших особистих даних, однак, будь
							ласка, майте на увазі, що незважаючи на наші зусилля, жодні заходи
							захисту даних не можуть гарантувати абсолютну безпеку. 
						</p>
						<p>
							Поширення персональних даних без згоди Користувачів можливе лише у
							випадках, визначених законом, і лише (якщо це необхідно) в
							інтересах національної безпеки, економічного добробуту та прав
							людини.
						</p>
						<p>
							Для вирішення будь-яких питань, повʼязаних із цією Політикою
							конфіденційності, роботою Сайту, або для отримання додаткової
							інформації про порядок збору, обробки, використання, розкриття та
							захисту персональних даних Користувачів, будь ласка, звʼяжіться з
							Розробником за адресою: contact@ayma.tech
						</p>
					</div>
				</div>
			</div>
		</div>
	)
}

export default Privacy
